{
  "_name_or_path": "dima806/facial_age_image_detection",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "01",
    "1": "02",
    "2": "03",
    "3": "04",
    "4": "05",
    "5": "06-07",
    "6": "08-09",
    "7": "10-12",
    "8": "13-15",
    "9": "16-20",
    "10": "21-25",
    "11": "26-30",
    "12": "31-35",
    "13": "36-40",
    "14": "41-45",
    "15": "46-50",
    "16": "51-55",
    "17": "56-60",
    "18": "61-65",
    "19": "66-70",
    "20": "71-80",
    "21": "81-90",
    "22": "90+"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "01": 0,
    "02": 1,
    "03": 2,
    "04": 3,
    "05": 4,
    "06-07": 5,
    "08-09": 6,
    "10-12": 7,
    "13-15": 8,
    "16-20": 9,
    "21-25": 10,
    "26-30": 11,
    "31-35": 12,
    "36-40": 13,
    "41-45": 14,
    "46-50": 15,
    "51-55": 16,
    "56-60": 17,
    "61-65": 18,
    "66-70": 19,
    "71-80": 20,
    "81-90": 21,
    "90+": 22
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "transformers_version": "4.44.0.dev0"
}
